Backend/loadtest/k6/results/baseline/auth/report-2026-07-21-235854.txt
     ✓ register status is 201
     ✓ login status is 200

     checks.........................: 100.00% ✓ 1666      ✗ 0   
     data_received..................: 1.3 MB  18 kB/s
     data_sent......................: 552 kB  7.7 kB/s
     http_req_blocked...............: avg=26.31µs  min=0s      med=0s       max=8.65ms   p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=19.15µs  min=0s      med=0s       max=1.6ms    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=111.9ms  min=84.28ms med=117.94ms max=467.8ms  p(90)=132.46ms p(95)=138.04ms
       { expected_response:true }...: avg=111.9ms  min=84.28ms med=117.94ms max=467.8ms  p(90)=132.46ms p(95)=138.04ms
     http_req_failed................: 0.00%   ✓ 0         ✗ 1666
     http_req_receiving.............: avg=259.28µs min=0s      med=0s       max=2.12ms   p(90)=867.75µs p(95)=981.3µs 
     http_req_sending...............: avg=5.87µs   min=0s      med=0s       max=805.4µs  p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=111.64ms min=83.75ms med=117.85ms max=466.36ms p(90)=132.29ms p(95)=137.94ms
     http_reqs......................: 1666    23.370742/s
     iteration_duration.............: avg=2.22s    min=2.2s    med=2.22s    max=2.56s    p(90)=2.23s    p(95)=2.24s   
     iterations.....................: 833     11.685371/s
     vus............................: 3       min=1       max=50
     vus_max........................: 50      min=50      max=50